RogueMaster/flipperzero-firmware-wPlugins/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
#if FLOCK_ARDUINO3
/** Arduino String -> std::string, preserving embedded NULs. */
static inline std::string fstr(const String& s) {
    return std::string(s.c_str(), s.length());
}
/** 3.x hands back a pointer to the scan's internal results. */
#define FLOCK_SCAN(scan, secs) (*(scan)->start((secs), false))
/** Same, but `cont` keeps results accumulated from earlier slices. */
#define FLOCK_SCAN_CONT(scan, secs, cont) (*(scan)->start((secs), (cont)))
/** 3.x: already a flat pointer to the 6 address bytes. */
static inline const uint8_t* fble_addr_bytes(BLEAddress& a) {
    return a.getNative();
}
#else
/** 2.x already returns std::string; pass through so call sites stay identical. */
static inline std::string fstr(const std::string& s) {
    return s;
}
/** 2.x returns by value. */
#define FLOCK_SCAN(scan, secs) ((scan)->start((secs), false))
/** Same, but `cont` keeps results accumulated from earlier slices. */
#define FLOCK_SCAN_CONT(scan, secs, cont) ((scan)->start((secs), (cont)))
/** 2.x: uint8_t(*)[6], so one deref yields the uint8_t*. */
static inline const uint8_t* fble_addr_bytes(BLEAddress& a) {
    return *a.getNative();
}
#endif

// ---- Flock-associated OUI prefixes (31) ----------------------------------
// MUST stay byte-identical to flock_ouis[] in helpers/flock_db.c. There is no
// shared header (an Arduino sketch cannot include the app's), so editing one
// side alone would silently desync ESP-side `conf` scoring from the Flipper's.
// tools/check_oui_parity.py is a REQUIRED CI gate that catches exactly that.
// See flock_db.c for the provenance notes. f8:a2:d6 dropped 2026-07-27 (upstream
// false positive: hit on a Sony Media Player) -- do NOT re-add it from the older
// flat OUI list.
//
// The last entry, b4:1e:52, is Flock Safety's own registered OUI (GainSec).
// Row layout matches flock_db.c line-for-line so the two can be diffed by eye.
static const uint8_t FLOCK_OUIS[][3] = {
    {0x70, 0xc9, 0x4e}, {0x3c, 0x91, 0x80}, {0xd8, 0xf3, 0xbc}, {0x80, 0x30, 0x49},
    {0xb8, 0x35, 0x32}, {0x14, 0x5a, 0xfc}, {0x74, 0x4c, 0xa1}, {0x08, 0x3a, 0x88},
    {0x9c, 0x2f, 0x9d}, {0xc0, 0x35, 0x32}, {0x94, 0x08, 0x53}, {0xe4, 0xaa, 0xea},
    {0xf4, 0x6a, 0xdd}, {0x24, 0xb2, 0xb9}, {0x00, 0xf4, 0x8d}, {0xd0, 0x39, 0x57},
    {0xe8, 0xd0, 0xfc}, {0xe0, 0x4f, 0x43}, {0xb8, 0x1e, 0xa4}, {0x70, 0x08, 0x94},
    {0x58, 0x8e, 0x81}, {0xec, 0x1b, 0xbd}, {0x3c, 0x71, 0xbf}, {0x58, 0x00, 0xe3},
    {0x90, 0x35, 0xea}, {0x5c, 0x93, 0xa2}, {0x64, 0x6e, 0x69}, {0x48, 0x27, 0xea},
    {0xa4, 0xcf, 0x12}, {0x82, 0x6b, 0xf2}, {0xb4, 0x1e, 0x52},
};
static const size_t FLOCK_OUI_COUNT = sizeof(FLOCK_OUIS) / sizeof(FLOCK_OUIS[0]);

// ---- SoundThinking / ShotSpotter acoustic sensors (1) --------------------
// A DIFFERENT DEVICE CLASS from the ALPRs above: these listen, they do not read
// plates. Matches are tagged `cls=a` on the wire so the Flipper can say which it
// found. MUST stay byte-identical to soundthinking_ouis[] in helpers/flock_db.c.
static const uint8_t SOUNDTHINKING_OUIS[][3] = {
    {0xd4, 0x11, 0xd6},
};
static const size_t SOUNDTHINKING_OUI_COUNT =
    sizeof(SOUNDTHINKING_OUIS) / sizeof(SOUNDTHINKING_OUIS[0]);

// ---- State ---------------------------------------------------------------
//
// THREADING. promisc_cb() runs in the WiFi driver task (usually core 0) and
// loop()/handle_command() run in the Arduino task (core 1), so everything they
// share needs `volatile` at minimum, and a critical section wherever a read and
// a write must agree with each other.
//
// g_mux guards the two places where a torn read is not merely inaccurate but
// unsafe or wrong: the beacon ring (whose count BOUNDS an array write) and the
// Locator target (a 6-byte MAC that must be swapped atomically or promisc_cb
// homes on a half-old, half-new address for a few frames).
//
// The frame counters below are deliberately NOT protected. `volatile` does not
// make `++` atomic, so they can lose the odd increment under contention -- but
// they are display-only rate indicators reset every interval, and taking a lock
// per frame inside the WiFi callback would cost more than the drift.
static portMUX_TYPE g_mux = portMUX_INITIALIZER_UNLOCKED;

static volatile bool g_scanning = true;
static volatile uint32_t g_frames = 0;
static volatile uint32_t g_hits = 0;
static volatile uint32_t g_deauths = 0; // deauth + disassoc frames seen (attack indicator)
static volatile uint8_t g_channel = 1;
static uint8_t g_lock_channel = 0; // 0 = hop
/** Highest 2.4 GHz channel the hopper visits. See the hop block in loop(). */
#define MAX_HOP_CHANNEL 13

/* ---- Dual-band (5 GHz) support -------------------------------------------
 *
 * A 2.4-only companion CANNOT SEE a Flock uplink on 5 GHz -- not "sees it
 * weakly", cannot see it at all. The ESP32-C5 is the first Espressif part with a
 * 5 GHz radio, so on that chip we hop both bands.
 *
 * Gated on the SoC capability, not on a board name: SOC_WIFI_SUPPORT_5G comes
 * from the IDF's own soc_caps.h, so a classic ESP32/S3/C3 compiles exactly as
 * before and pays nothing (the 5 GHz table is not even emitted). Requires
 * Arduino core 3.x, which is where the C5 exists at all.
 *
 * Channel list is the 28 20 MHz channels the IDF enumerates for this radio
 * (esp_wifi_types_generic.h). Band switching is done purely by setting the
 * channel: the IDF docs say to prefer esp_wifi_set_channel() over
 * esp_wifi_set_band(), and it moves bands on its own once band mode is AUTO.
 *
 * COST, stated plainly: a full sweep goes from 13 channels to 41. At the same
 * 300 ms dwell that is ~12.3 s per sweep instead of ~3.9 s, so a given camera is
 * revisited a third as often. That is the honest price of covering a band we
 * currently cannot see, and `band 2g` returns the fast sweep for anyone who
 * wants it.
 */
#if defined(SOC_WIFI_SUPPORT_5G) && SOC_WIFI_SUPPORT_5G
#define FLOCK_HAS_5GHZ 1
#else
#define FLOCK_HAS_5GHZ 0
#endif

#if FLOCK_HAS_5GHZ
/** 5 GHz 20 MHz channels, incl. DFS (52-144) -- we only ever listen. */
static const uint8_t CHANNELS_5G[] = {36,  40,  44,  48,  52,  56,  60,  64,  100, 104,
                                      108, 112, 116, 120, 124, 128, 132, 136, 140, 144,
                                      149, 153, 157, 161, 165, 169, 173, 177};
#define CHANNELS_5G_COUNT (sizeof(CHANNELS_5G) / sizeof(CHANNELS_5G[0]))
#endif

/** Which band(s) the hopper sweeps. `band 2g|5g|all` selects at runtime. */
typedef enum {
    FlockBand2G = 0,
    FlockBand5G = 1,
    FlockBandAll = 2,
} FlockBandSel;

/* Default: sweep everything the radio can reach. On a 2.4-only part this is
 * identical to the old behaviour, because the 5 GHz list does not exist. */
#if FLOCK_HAS_5GHZ
static FlockBandSel g_band = FlockBandAll;
#else
static FlockBandSel g_band = FlockBand2G;
#endif

/** Hop cursor: index into the logical (2.4 then 5) channel sequence. */
static uint16_t g_hop_i = 0;

/** True if `ch` is a 5 GHz channel number (2.4 GHz tops out at 14). */
static inline bool is_5ghz_channel(uint8_t ch) {
    return ch >= 36;
}

/** Number of channels in the current sweep. */
static uint16_t hop_count() {
    uint16_t n = 0;
    if(g_band == FlockBand2G || g_band == FlockBandAll) n += MAX_HOP_CHANNEL;
#if FLOCK_HAS_5GHZ
    if(g_band == FlockBand5G || g_band == FlockBandAll) n += CHANNELS_5G_COUNT;
#endif
    return n ? n : MAX_HOP_CHANNEL; // never zero: degrade to 2.4 rather than stall
}

