RogueMaster/flipperzero-firmware-wPlugins/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
    // Run the scan as 1-second slices, draining the GPS between each.
    //
    // BLEScan::start() blocks, so one 3 s call also stops loop() for 3 s -- and
    // loop() is what empties Serial1. At 9600 baud that is ~2.9 KB of NMEA
    // arriving against the RX buffer, so sentences were dropped outright; even
    // the survivors left the fix up to ~4 s old. At 50 km/h a 4 s old fix
    // geotags a camera ~55 m from where it really is, which is worse than
    // useless on a DeFlock submission.
    //
    // is_continue = true keeps the library's accumulated results, so total
    // dwell, dedup and the reported device list are preserved. Not quite free:
    // each slice restarts GAP scanning, so a few milliseconds of advert time is
    // lost per boundary (two boundaries at the default 3 s). BLE advertisers
    // repeat every 20-100 ms, so that is far below the noise floor of whether a
    // given device is seen at all -- and a fix that is 1 s old instead of 4 s is
    // worth much more than those milliseconds.
    //
    // 1 s is the floor because start() takes whole seconds.
    for(int i = 0; i < seconds - 1; i++) {
        FLOCK_SCAN_CONT(g_ble, 1, i > 0);
        gps_poll();
    }
    // Last slice returns the accumulated results. is_continue only when earlier
    // slices actually ran, so a 1-second scan still starts from a clean list.
    BLEScanResults found = FLOCK_SCAN_CONT(g_ble, 1, seconds > 1);
    gps_poll();
    int count = found.getCount();
    if(count > 80) count = 80;
    int spam = 0; // impersonation/pairing adverts -> BLE-spam flood indicator
    for(int i = 0; i < count; i++) {
        BLEAdvertisedDevice d = found.getDevice(i);

        int company = -1;
        int cat = 0;
        // raven: set when this device exposes a Raven-specific GATT service
        // (0x3100-0x3500). Tracked separately from cat because cat=1 also covers
        // the shared battery / Penguin / OUI cases -- only the GATT match is a
        // positive Raven (acoustic) ID, so we surface it as its own rv=1 field.
        bool raven = false;
        if(d.haveManufacturerData()) {
            std::string md = fstr(d.getManufacturerData());
            if(md.length() >= 2) company = (uint8_t)md[0] | ((uint8_t)md[1] << 8);
            if(company == 0x09C8)
                cat = 1; // Flock Safety / Raven
            else if(company == 0x004C && md.length() >= 3 && (uint8_t)md[2] == 0x12)
                cat = 2; // Apple Find My / AirTag
        }
        if(cat != 1 && d.haveName()) {
            std::string nm = fstr(d.getName());
            if(nm.rfind("Penguin", 0) == 0 || nm.find("FS Ext") != std::string::npos)
                cat = 1; // Flock Penguin battery / FS external battery
        }
        if(d.haveServiceUUID()) {
            std::string u = fstr(d.getServiceUUID().toString());
            if(u.find("00003100") != std::string::npos || u.find("00003200") != std::string::npos ||
               u.find("00003300") != std::string::npos || u.find("00003400") != std::string::npos ||
               u.find("00003500") != std::string::npos) {
                cat = 1; // Raven custom GATT services
                raven = true; // Raven-specific GATT -> positive acoustic-sensor ID
            }
            else if(cat == 0 && (u.find("feed") != std::string::npos || u.find("feec") != std::string::npos))
                cat = 3; // Tile
            else if(cat == 0 && u.find("fd5a") != std::string::npos)
                cat = 4; // Samsung SmartTag
            else if(cat == 0 && u.find("feaa") != std::string::npos)
                cat = 5; // Google Find My Device network (Pebblebee/Chipolo/Moto/Eufy)
        }
        if(cat == 0) {
            BLEAddress ba = d.getAddress();
            const uint8_t* nat = fble_addr_bytes(ba); // shape differs 2.x vs 3.x
            if(nat && oui_match(nat)) cat = 1; // Flock OUI on the BLE address
        }

        // Apple/Tile/Samsung/Google pairing adverts are what BLE-spam tools
        // (Flipper "BLE spam", ESP32 sour-apple, etc.) impersonate in bulk. A few
        // are normal; a flood of them in one scan is the spam signature.
        if(cat == 2 || cat == 3 || cat == 4 || cat == 5) spam++;

        std::string a = fstr(d.getAddress().toString());
        char addr[13];
        int k = 0;
        for(size_t j = 0; j < a.size() && k < 12; j++) {
            if(a[j] != ':') addr[k++] = a[j];
        }
        addr[k] = 0;

        // One buffer + single write (same rationale as the D-line) so the multi-field
        // BLE line is emitted atomically.
        char line[176];
        size_t pos =
            snprintf(line, sizeof(line), "BLE,%s,%d,%d,%d,", addr, d.getRSSI(), cat, company);
        if(d.haveName()) {
            std::string nm = fstr(d.getName());
            buf_append_escaped(line, sizeof(line), &pos, nm.c_str(), (int)nm.size(), 32);
        }
        // Trailing field: raw mfg-data hex for Flock (0x09C8) only, so the
        // Flipper can decode the device serial. Capped so the line stays well
        // under the Flipper's RX line limit; only Flock units carry it.
        if(cat == 1 && company == 0x09C8 && d.haveManufacturerData()) {
            std::string md = fstr(d.getManufacturerData());
            if(pos + 1 < sizeof(line)) line[pos++] = ',';
            for(size_t j = 0; j < md.length() && j < 31 && pos + 2 < sizeof(line); j++) {
                buf_appendf(line, sizeof(line), &pos, "%02x", (uint8_t)md[j]);
            }
        }
        // Raven GATT flag, emitted LAST so it follows the optional mfghex field.
        // The '=' lets the Flipper distinguish it from the pure-hex mfghex token.
        if(raven && pos + 5 < sizeof(line)) {
            memcpy(line + pos, ",rv=1", 5);
            pos += 5;
        }
        if(pos > sizeof(line) - 1) pos = sizeof(line) - 1;
        line[pos++] = '\n';
        Serial.write((const uint8_t*)line, pos);
    }
    Serial.printf("BEND,%d\n", count);

    // A bulk of impersonation/pairing adverts in a single scan = a BLE-spam
    // flood (independent BLE radio class for the app's fused score).
    if(spam >= BLE_SPAM_MIN) Serial.printf("ATK,blespam,%d\n", spam);

    g_ble->clearResults();
    esp_wifi_set_promiscuous(true);
    set_channel(g_channel);
}

