RogueMaster/flipperzero-firmware-wPlugins/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
// Locator (BLE): one short scan; emit the target's RSSI if seen. Builds the same
// lowercased, colon-stripped toString() form the BLE line uses, so the comparison
// is byte-order-safe against the addr the app originally parsed.
static void ble_locate_scan() {
    ble_ensure_init();
    esp_wifi_set_promiscuous(false);
    BLEScanResults res = FLOCK_SCAN(g_ble, 1);
    int best = -127;
    int n = res.getCount();
    for(int i = 0; i < n; i++) {
        BLEAdvertisedDevice d = res.getDevice(i);
        std::string a = fstr(d.getAddress().toString());
        char addr[13];
        int k = 0;
        for(size_t j = 0; j < a.size() && k < 12; j++) {
            char c = a[j];
            if(c == ':') continue;
            addr[k++] = (c >= 'A' && c <= 'Z') ? (char)(c + 32) : c;
        }
        addr[k] = 0;
        if(strcmp(addr, g_locate_macs) == 0) {
            int r = d.getRSSI();
            if(r > best) best = r;
        }
    }
    g_ble->clearResults();
    if(best > -127) Serial.printf("LOC,%d\n", best);
}

// ---- optional GPS relay (FlipDeFlock issue #5) ---------------------------
//
// Some carrier boards wire a GPS module to the ESP32 instead of to the Flipper's
// header. The Flipper then cannot see it on ANY pin setting, because the NMEA
// never reaches its GPIO. When switched on, read the module here and relay the
// sentences the Flipper's parser understands as `G,<sentence>` lines.
//
// OFF unless the app asks for it (`gps <rx> [baud]`): Serial1's pins differ per
// board and per chip, so a wrong guess would just spray a dead pin's noise onto
// a link that carries detections.
//
// Deliberately NOT parsed here. The Flipper already has a host-tested NMEA
// parser used by its own UART path; relaying raw sentences means one parser, one
// set of lock-loss semantics, and no duplicated coordinate maths on the ESP.
#define GPS_LINE_MAX 100 // NMEA caps a sentence at 82 incl. CRLF; headroom
// Sized for the worst configured baud, not the common one. The app offers up to
// 115200, and a 10 Hz receiver at that rate emits on the order of 6 KB/s. loop()
// now drains between 1-second BLE slices rather than being stalled for a whole
// 3-second scan, so one slice is the window this has to cover: 8 KB gives
// headroom over that with room for a scheduling hiccup. It is ~3% of the free
// heap the sketch reports, which is a cheap way to make dropped sentences a
// non-event instead of a silent position error.
#define GPS_RX_BUF   8192

static bool g_gps_on = false;
static int g_gps_rx = -1;
static uint32_t g_gps_baud = 9600;
static char g_gps_line[GPS_LINE_MAX];
static size_t g_gps_len = 0;

// Only the three sentence types the Flipper decodes (RMC / GGA / GLL). Filtering
// on this side keeps GSV/GSA/VTG chatter off a UART shared with detection lines
// -- a talkative receiver emits well over a dozen sentences per fix.
static bool gps_wanted(const char* s, size_t n) {
    if(n < 6 || s[0] != '$') return false;
    const char* t = s + 3; // '$' + 2-char talker (GP / GN / GL / GA / BD ...)
    return strncmp(t, "RMC", 3) == 0 || strncmp(t, "GGA", 3) == 0 || strncmp(t, "GLL", 3) == 0;
}

static void gps_relay_line() {
    if(!gps_wanted(g_gps_line, g_gps_len)) return;
    char out[GPS_LINE_MAX + 4];
    size_t pos = 0;
    out[pos++] = 'G';
    out[pos++] = ',';
    // Copy printable ASCII only. Commas and '$'/'*' MUST survive (they are the
    // sentence), so buf_append_escaped() is wrong here -- it maps ',' to '.'.
    // Anything outside printable ASCII is dropped rather than substituted: a
    // stray CR/LF would split the line and desync the Flipper's framing.
    for(size_t i = 0; i < g_gps_len && pos + 2 < sizeof(out); i++) {
        uint8_t c = (uint8_t)g_gps_line[i];
        if(c < 0x20 || c > 0x7E) continue;
        out[pos++] = (char)c;
    }
    out[pos++] = '\n';
    Serial.write((const uint8_t*)out, pos); // single write: atomic vs the WiFi task
}

static void gps_poll() {
    if(!g_gps_on) return;
    // Drain everything buffered, but emit at most ONE sentence of each type per
    // pass -- the newest.
    //
    // Only the current position matters, and the Flipper's parser ends up in the
    // same state either way: it applies sentences in order, so the last one wins.
    // Relaying a whole backlog instead would burn the Flipper's UART on
    // already-superseded fixes, competing with detection lines for the same link
    // at the exact moment a scan phase just ended and hits are being reported.
    //
    // Keeps the lock-loss semantics intact: "newest wins" is what the direct UART
    // path effectively does too, so a valid -> invalid transition still clears the
    // fix rather than being coalesced away.
    char last[3][GPS_LINE_MAX];
    size_t last_len[3] = {0, 0, 0};
    int budget = 4096; // generous: this runs once per pass, not per byte of link
    while(g_gps_on && Serial1.available() && budget-- > 0) {
        char c = (char)Serial1.read();
        if(c == '\n' || c == '\r') {
            if(g_gps_len && gps_wanted(g_gps_line, g_gps_len)) {
                // Bucket by sentence type so an RMC cannot displace a GGA: the
                // two carry different fields (course/validity vs satellites).
                const char* t = g_gps_line + 3;
                int slot = (strncmp(t, "RMC", 3) == 0) ? 0 : (strncmp(t, "GGA", 3) == 0) ? 1 : 2;
                memcpy(last[slot], g_gps_line, g_gps_len);
                last_len[slot] = g_gps_len;
            }
            g_gps_len = 0;
        } else if(g_gps_len + 1 < sizeof(g_gps_line)) {
            g_gps_line[g_gps_len++] = c;
        } else {
            // Overlong: drop the whole thing. Emitting a truncated sentence
            // would fail the Flipper's checksum check anyway, and a sentence
            // without its '*hh' could be parsed as a WRONG fix.
            g_gps_len = 0;
        }
    }
    // GGA first so the satellite count is in place before RMC's position/course.
    static const int order[3] = {1, 0, 2};
    for(int i = 0; i < 3; i++) {
        int slot = order[i];
        if(!last_len[slot]) continue;
        memcpy(g_gps_line, last[slot], last_len[slot]);
        g_gps_len = last_len[slot];
        gps_relay_line();
        g_gps_len = 0;
    }
}

// `gps off` | `gps <rx_pin> [baud]`. Echoes GPSCFG either way so a user hunting
// for their board's pin can confirm from a plain serial terminal. The Flipper
// ignores unknown lines, so the echo is safe on a live link.
static void gps_configure(int rx, uint32_t baud) {
    if(g_gps_on) {
        Serial1.end();
        g_gps_on = false;
    }
    g_gps_len = 0;
    if(rx >= 0) {
        g_gps_rx = rx;
        g_gps_baud = baud;
        Serial1.setRxBufferSize(GPS_RX_BUF);
        // RX only: we never talk to the receiver, so TX stays unassigned rather
        // than claiming a second pin the board may be using for something else.
        Serial1.begin(g_gps_baud, SERIAL_8N1, g_gps_rx, -1);
        g_gps_on = true;
    }
    Serial.printf("GPSCFG,%d,%d,%lu\n", g_gps_on ? 1 : 0, g_gps_rx, (unsigned long)g_gps_baud);
}

void setup() {
    Serial.begin(115200);
    // Short RX timeout so loop()'s readStringUntil('\n') can't stall channel-hop /
    // heartbeat for the default 1 s when a command arrives without a trailing newline.
    Serial.setTimeout(20);
    delay(200);

    nvs_flash_init();
    esp_event_loop_create_default();
    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    esp_wifi_init(&cfg);
    esp_wifi_set_storage(WIFI_STORAGE_RAM);
    esp_wifi_set_mode(WIFI_MODE_NULL);
    esp_wifi_start();
#if FLOCK_HAS_5GHZ
    // AUTO = 2.4 + 5. Must be set before hopping: with the default 2.4-only mode
    // a 5 GHz set_channel() is rejected and the sweep silently covers half of
    // what it reports. Non-fatal if it fails -- hop_channel() still yields valid
    // 2.4 GHz channels, so the companion degrades to the classic behaviour
    // instead of scanning nothing.
    if(esp_wifi_set_band_mode(WIFI_BAND_MODE_AUTO) != ESP_OK) {
        g_band = FlockBand2G;
    }
#endif
    start_promisc();

    banner();
}

